In [1]:
 # it assigns each unique vale to a differnt vatiable

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy as sc

In [4]:
data = pd.DataFrame({
    'Age' :[12,34,56,22,24,35],
    'Income' : ['Low','Low','High','Medium','Medium','High']
})

In [5]:
data

   Age  Income
0   12     Low
1   34     Low
2   56    High
3   22  Medium
4   24  Medium
5   35    High

In [6]:
data.Income.map({'Low':1,'Medium':2,'High':3})

0    1
1    1
2    3
3    2
4    2
5    3
Name: Income, dtype: int64